[
  {
    "text": "Clean. Staff is friendly and helpful. No AC but they bring you a little AC unit when requested"
  },
  {
    "text": "I encountered a few really lovely staff during my 3 night stay at the Clayton, so I hate to generalize, but the customer service here is laughably bad. Located about 30 minutes walking from the city center, the location is not ideal for tourists. There is no public transportation in this area, so unless you enjoy a lot of walking, be prepared to spend €€€ on taxis. My initial impression of the hotel was good. The lobby is a bit noisy and there is really only seating in the upstairs lounge area, but it is comfortable and the WiFi works well. Lots of outlets. Our room was nothing special, but certainly a step above average. Premium linens, comfortable mattress, spacious additional seating area, large bathtub. No temperature control in the room, which is always kept very hot (I guess that's better than too cold?) Clean, minimalist decor. Complimentary newspapers and little boxes of chocolate outside the door each day were a nice touch. On my first day at the hotel, I asked one of the receptionists if I was able to exchange money there. She said yes, and asked me to wait 10 minutes while she verified the rates. 10 minutes later, she said their system is down and they cannot change money today. I asked again the next day, and was told they do not change money here at all and that I should try a place in the city center. Okay. On my final evening at the Clayton, I had to depart at 3am to catch an early flight home to Los Angeles. The internet told me that there are local buses running every 30 minutes from a bus stop right outside the hotel. So, I waited, and waited (about 30 mins), in 30 degree weather, and no bus came. I went back into the hotel and asked the young man working for some help. 'You can take a taxi which will be €30, or you can wait more. The buses run 24 hours, one will come.' The Dublin airport is only a 15 minute drive away, so spending €30 when I could spend €5 seemed foolish. I asked him to please help me figure out a reliable bus option that would depart within the next hour and he rudely replied that he could print me out a timetable, but otherwise didn't know what to tell me. 'The busses don't run on time. Maybe cross the bridge and wait over at that bus stop. Or just pay for a taxi.' Yeah, I would pay for a taxi if you guys would exchange my cash. The complete lack of concern or interest in actually helping a woman with an upcoming international flight was appalling. Shoutout to the old lady in the lobby who watched the whole thing go down and called him a dickhead. Avoid."
  },
  {
    "text":"Nice hotel. Bigger than expected rooms. Quiet neighborhood and very comfortable beds. Great local restaurants and there is a grocery up at the Grand Canal. I wish there was a fridge, but knew they didn't have them. USB power built in to nightstand are very helpful. Someone complained about the showers being confusing. They are simple. Top knob is water on/off and pressure. Bottom knob is temperature control 30-48 C. Pretty nice actually."
  },
  {
    "text": "We're spending 4 nights in Dublin, and we're having a wonderful time! They even upgraded us to one of their executive guest suites. It's perfect since we're celebrating a newly earned Master's Degree. Once they heard about the degree, they dropped off a complimentary bottle of red wine and chocolates. The food and service are amazing, and anytime a question arises, they're very accommodating and always have great answers. 10/10 - We will definitely stay here again. If you're in the hunt for a hotel go ahead and book this one now! Any questions? Ask for Carlos - he's THE MAN!"
  },
  {
    "text": "Very good hotel. Great pool and jacuzzi, great food! Everyone seemed very nice and gave all their attention when needed. My only suggestion is: if you plan on doing outside of the city tours, which leave the city early in the morning, do not sign up for the breakfast for a lower rate. We ended up paying for two days that we were not able to get breakfast (we thought that by not being at the restaurant they would not charge us, but they do). Aside from that, I would definitely come back to this hotel next time I am in Dublin (it is close to everything! 20 min walk from Temple Bar, to have an idea, plus close to many bus stops and the LUAS)."
  },
  {
    "text": "Last day of a lovely 11 day CIE tour of Scotland and Ireland. We have been through 3 countries and stayed in 7 hotels. This one recently jumped to the worst after a shockingly rude experience from the porters. My sister and I are traveling on the tour with hiking backpacks. Nothing is in the paperwork about travelers using wheeled luggage only as portage is included in the trip. The porter from the Clayton Hotel (our last of 7) just dragged my bag down the hall from the waist strap and told me at the door 'you're lucky I brought that up here'. Our luggage has never been an issue elsewhere, and there is no requirement to use 'wheeled bags' only for the portage so I was absolutely shocked by this behavior at the end of our great trip. It's left a bit of a sour taste in my mouth after what has been lovely trip. Too bad Dublin, you've let me down once again."
  },
  {
    "text": "I thought the staff was great and accommodating. Everyone working the front desk is so nice. I would definitely stay here again. And the location is perfect! I liked the rooms, they were spacious."
  },
  {
    "text": "I stayed here August 2017. I have no issue with the hotel. The hotel rooms are spacious. No problem with staff. Hotel does not have airconditioning. If it is hot, you can request a fan from the front desk. The room has no microwave or fridge. Wifi is great. Breakfast place has everything, in a buffet style. Hotel can be reached from the airport by riding a bus. I stayed here because the hotel is close to the Convention Center. But, I find the hotel is far from the interesting places in Dublin. it is far from Trinity College, from the Temple Bar, etc. There are limited stores and restaurants in the immediate area. This hotel is located in somewhat the business area. As I've said, I have no issue with the hotel. the hotel is satisfactory, however, if I'll travel back to Dublin, I'll choose a hotel closer to the Temple Bar or busier places in Dublin."
  },
  {
    "text": "I had the pleasure to stay at this hotel for five days in early June. If you don't mind a little stroll to get to the city center, I can highly recommend this hotel right across the CCD. The front desk is exceptionally friendly and helpful. The rooms provide ample space and are clean and equipped with a tea kettle (something you rarely find here in Germany). The breakfast leaves absolutely nothing to be desired. And the next pub is where all pubs in Dublin seem to be - right on the next corner."
  },
  {
    "text": "The bar and cafe just above the lobby of the Maldron Hotel, now the Clayton, is a nice spot to grab a drink with friends, before heading out from the hotel, or for a meeting. The couches are fairly comfortable but not great for a long sit. The wifi was a bit spotty as well. the beer and drink menu was fairly small without much more than coffee, tea, and Guinness. Service was very friendly but a little slow as the beer took a noticeably long time to arrive and had to be corrected. The space is nice, but can be a little noisy from the lobby."
  },
  {
    "text": "Not Impressed, very disappointed. We were staying at this hotel November 12-19 because my husband was speaking at a conference. While the hotel knew that many of us were flying in internationally, you would think they would have accommodated arrivals. We had to wait hours before the room was ready. The showers here are really jacked up. We travel all over the world, and have no problem figuring out different types of showers, they are pretty straightforward. We finally got it figured out, the showers were the running joke with all of the speakers. We were telling our cab driver about the shower and he said the Clayton was a remodeled Holiday in (the remodel fun must have ran out so they skipped the showers). One of the speakers kept complaining about is freezing cold shower. We kept telling him how it operated but it still didn't work. We finally told him to complain to management. It ended up that the shower was broken. Many of us would hang out in the lobby bar. Service there was horrible. One of the speakers ordered a dinner and they totally forgot about her order. We were trying to eat dinner and get out of the hotel, there wasn't enough time to cook what she had originally ordered, so she had to order something else. The worst part about this hotel is absolutely disgusting. I was in the room while the maid came in to clean it. She had a rag she was using to clean the room. She took the glasses that were provided in the room to the bathroom. She rinsed out the glasses and walked out with them one at a time drying them off with the same rag she had just got done cleaning with, GROSS! As a person that has a lower immune system and cannot risk germs/bacteria this was totally unacceptable. But from anyone's point of view this is disgusting. When we stay at Marriott hotels the cleaning people have a cart with fresh glasses and didn't notice any of the cleaning people with glasses on their carts. When I said something to the people at the front desk about the glasses they told me that what the maid did wasn't their norm. That was a straight out lie since nobody had glasses on their carts. This is not a hotel I would personally choose to not stay at again. If after all of this you think you would still consider it I recommend doing what I did, ask the front desk for get to go cups."
  },
  {
    "text": "Good service, clean rooms, easy to get around Dublin from here and kids thought they were in a castle. Room was quiet, even with the window open...birds were loud in morning but a lovely way to wake up."
  },
  {
    "text": "Note to travelers...never arrive at this place prior to noon unless you like sitting on the tired furniture in the lobby because there is a high likelihood they won't have a room for you."
  },
  {
    "text": "Great service, helpful and friendly staff. Very comfortable rooms that were pristine in cleanliness. Great location! Child friendly. Nice pool and leisure centre."
  },
  {
    "text": "It's in a great location lovely breakfast the rooms are basic but they are what you need my experience wasn't positive room key never worked consistently television never worked! All my shoes were resolved they put us in the new room and they fixed the television they have a 2/5 rating to see how they going to resolve some kind of resolution to some of the issues with have"
  }
]
